[
  {
    "path": "project/2023-08-15-tx-mega-regions/",
    "title": "Get to Know Texas' Mega Regions",
    "description": "A data story of Texas' growing mega-regions.",
    "author": [],
    "date": "2023-08-15",
    "categories": [
      "People Movement",
      "GIS",
      "Cartography",
      "Data Visualization"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\nOlder Version\r\n\r\n\r\n\r\nView Github Repo:    Code \r\n\r\n\r\n\r\n",
    "preview": "project/2023-08-15-tx-mega-regions/flows-GRAPHIC_trimed_v2.jpg",
    "last_modified": "2023-09-20T11:55:59-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-07-16-southcentraltx/",
    "title": "Maps of South Central Texas",
    "description": "A sample of maps of South Central Texas.",
    "author": [],
    "date": "2023-07-16",
    "categories": [
      "GIS",
      "Cartography"
    ],
    "contents": "\r\nClimb South Central Texas\r\nA map of bouldering locations - outdoor and indoor - in the Texas Hill Country Metro region.\r\n\r\n\r\n\r\nSources\r\nMap: Mapbox\r\nFont: Alpine Serif by Sarah Bell\r\nFiesta City\r\nA minimalist map of San Antonio colored in the Fiesta celebration theme that I created for a friend. The colors of the land-use layers are applied to only the green space, commercial and industrial, and education/cultural land use attributes.\r\n\r\n\r\n\r\nSources\r\nMap: Mapbox\r\nLanduse Data: Open Street Map\r\n\r\n\r\n\r\n",
    "preview": "project/2023-07-16-southcentraltx/climb-south-central-texas2.png",
    "last_modified": "2023-08-19T14:53:18-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-27-urbanparks/",
    "title": "Spatial Accessibility and Use of Urban Parks",
    "description": "A sampling of maps depicting walkable access to parks.",
    "author": [],
    "date": "2023-06-27",
    "categories": [
      "GIS",
      "Data Visualization",
      "Neighborhoods",
      "Recreation"
    ],
    "contents": "\r\nData Sources\r\nTrust for Public Lands Park Database, 2019\r\nAmerican Community Survey 2015-2019\r\nSafeGraph’s Nature Park Mobility, 2019\r\nAnalysis:\r\nI conducted an accessibility analysis for parks in the ten most populous cities as of 2019. Following the Trust for Public Land’s recommendation to ensure parks are within a 10-minute walk of urban residents, I define the population living within a 10-minute walk of a park as having spatial access. I calculated 10-minute walking zone polygons around each park using Mapbox’s isochrone API.\r\nAfter intersecting the isochrone polygons and census block groups, I computed the total population that lives within the isochrones in each city and disaggregated the population by racial/ethnic demographic categories. I gathered the population estimates for park accessibility by performing simple area-weighted apportionment, which assumes that the population is evenly distributed across the city block group.\r\nIn addition to mapping the results of the accessibility analysis, I also mapped the census block groups that fell in the top 25% by frequency of monthly trips to the park per capita. I identified the most frequent park-use subset of census block groups using a spatial SQL query.\r\nResults\r\nAmong America’s ten most populous cities, walkable access to parks is highest in the smallest scale, most dense cities. The table below shows that sunbelt cities like Phoenix and San Antonio have the most pronounced access gaps with approximately 50% of the population living within a 10-minute walk of a park. Houston is the only city where walkable park access was statistically significantly lower for non-white populations - Black (57%), Hispanic (61%), Asian (61%) - compared to the white population.\r\n\r\n\r\n\r\nThe frequency of trips to park per capita across neighborhoods in these ten cities is similar. Monthly per capita trips range from 2.5 in Phoenix to 3.5 in Philadelphia. The maps in Figures 1 and 2 show that highest park use is most prevalent in the neighborhoods with spatial access to parks, especially larger park areas. High park usage rates tend to cluster downtown neighborhoods in the three cities with the lowest level of spatial access - Houston, San Antonio, and Phoenix - which signals the value of walkable amenities in the smaller scale regions of these more car-centric cities.\r\n\r\n\r\n\r\nFigure 1: Maps of Top 5 Cities by Spatial Access\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 2: Maps of Bottom 5 Cities by Spatial Access\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-27-urbanparks/NYC.jpg",
    "last_modified": "2023-08-19T14:52:17-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-25-mapboxbasemaps/",
    "title": "Basemap Syling in Mapbox",
    "description": "View basemaps that I have created in Mapbox using place-based styles.",
    "author": [],
    "date": "2023-06-25",
    "categories": [
      "Cartography"
    ],
    "contents": "\r\nStanford University Style\r\n\r\n\r\nView full screen here.\r\nCopy/Download style here.\r\nThe view below features GPS tracks from my Walks, Runs, and Bikes at Stanford\r\nView full screen here.\r\n\r\n\r\nMap developed based on Stanford brand color palette and typography.\r\nUniversity of Pennsylvania Style\r\n\r\n\r\nView full screen style here.\r\nCopy/Download style here.\r\nMap developed based on University of Pennsylvania brand color palette and typography.\r\nBay Area Style\r\n\r\n\r\nView full screen style here.\r\nCopy/Download style here.\r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-25-mapboxbasemaps/penn_style.jpg",
    "last_modified": "2023-08-19T14:21:39-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-06-airbnb/",
    "title": "Airbnb Neighborhood Descriptions & Racial Stereotypes",
    "description": "I conducted NLP analyses of neighborhood descriptions from Airbnb listings to identify how the language used to market neighborhoods to prospective tourists differed by neighborhood racial composition.",
    "author": [],
    "date": "2023-03-18",
    "categories": [
      "NLP",
      "GIS",
      "Data Visualization",
      "Research Paper",
      "Neighborhoods"
    ],
    "contents": "\r\nAbstract: This study investigates how place-based entrepreneurs market their neighborhoods to prospective visitors in the face of deeply entrenched stereotypes about neighborhoods of color and the urban core. I leverage place-based geospatial sentiment data from 19,967 Airbnb listings located in Los Angeles, California located in 2,156 census block groups of which 1,316 (61%) were not majority white and apply NLP topic modeling. Hosts’ descriptions of predominantly white neighborhoods focus on the physical and landscape aesthetics of the neighborhood, whereas minority-majority neighborhoods include more details about residents as well as the safety of the community. Language that deflects negative stereotypes about minority neighborhoods is most explicit in descriptions of urban core neighborhoods where Black residents are the majority or plurality. Overall, the findings suggest that the neighborhood marketing strategies in Airbnb’s online platform transmit existing urban inequalities to prospective tourists by implicitly or explicitly engaging with stereotypes about race and urban life.\r\n\r\n   Paper \r\n   Slides \r\n   Lightning Talk Slides \r\n\r\nSelected Visualizations\r\n\r\n\r\n\r\nStudy Area & Sample. Among the 2,156 neighborhoods, the most common racial types were Majority Hispanic (35%) and White-Hispanic Mixed (20%). The average median household income of neighborhoods was $94,367 (SD = 46,394). Neighborhoods where white residents were the most common group accounted for 39% of the sample, and they tended to be more affluent (average median household income = $110,064 vs. $72,518 for all other neighborhood types).\r\n\r\n\r\n\r\nFigure 1: Figure 3\r\n\r\n\r\n\r\nLeisure Activities and Amenities. The language used to describe leisure activities and amenities differed across racial neighborhood types (see Figure 3). As a group, the whitest neighborhood types had the greatest number of significant topics in this leisure activity/amenities LIWC dictionary category compared to all other race types. The leisure-related topics that surfaced in predominantly white neighborhood descriptions –upscale dining and shopping experiences (fine dining, Grove, Rodeo Drive) – can be construed as classed-amenities, which distinguishes the topics from the majority white mixed neighborhood types, which brought up shops and retail establishments (shops, art, cafes, boutiques) that did not signal class as clearly. Majority white Asian mixed and majority white Hispanic mixed types showed significant correlations with outdoor and physical activities (park-going, golfing, tennis, beach-going) and cultural institutions and arts activities (theaters, art museum, galleries). Albeit white residents are not the majority in Hispanic white mixed neighborhood, this type also contains topics associated with outdoor activities (Echo Lake Park, hiking, aquarium, shoreline) this suggests that as the share of white residents increases, neighborhood descriptions are more likely to surface outdoor activities or points of interest.\r\nOn the other hand, Majority Asian, Hispanic Black mixed, and Black white Mixed neighborhoods commonly referenced the many amenities of the downtown district (nightlife, events, arts, businesses) for guests to explore. Majority Black neighborhoods focused on proximity to major entertainment points of interest including professional sporting and gambling venues (stadium, casino, coliseum). Across the neighborhood types where minorities were the majority, the leisure amenities are part of the built environment associated with urban life.\r\n\r\n\r\n\r\nFigure 2: Figure 4\r\n\r\n\r\n\r\nFamily, Friends, and Homes. Topics that were correlated with LIWC’s family, friends, and home dictionaries also demonstrated racialized patterns (see Figure 4). Nature and images associated with lower levels of urbanicity appear in the topics positively associated with the LIWC Friends/Family/Home dictionaries for the whitest neighborhood types and the most Hispanic neighborhoods. Predominantly white neighborhoods described the aesthetics of the neighborhood having beautiful views of nature (views of mountains, hills, tree-lined streets, ocean) and white Hispanic mixed neighborhoods emphasized their neighborhoods’ location in hills (up, high, canyon). Descriptions of white Asian mixed neighborhoods focused on the physical layout of the neighborhood in the style of an urban village (village, nestled, campus, historic). By emphasizing characteristics of the neighborhood and apartments layout that signal medium-density housing and mixed-use zoning the hosts paint a picture of a less urbanized neighborhood. Similarly, in neighborhoods where Hispanics are the majority or plurality the descriptions contain language that signals more suburbanized style of housing by referencing zoning and home values (single-family, million dollar), quiet homes and streets (private, gated, cul-de-sacs, no traffic, hidden gem), and trendy college-town retail (hip, spots). The similarity across white Asian mixed, majority Hispanic, and Hispanic white mixed neighborhoods are the prevalence of descriptors that diverge from prototypical images of urbanicity. However, the sharpest divergence from high urbanicity appeared in the descriptors in predominantly white neighborhoods, which leaned into natural scenery present in exurban environments.\r\nIn contrast to the majority White neighborhoods, the descriptions of majority Hispanic, Majority Black, and Black-White mixed neighborhoods attended to the demographic characteristics of the people in the neighborhood and physical assurances of safety offered by the housing and built environment. Majority Black and majority Hispanic neighborhood descriptions had the greatest number of topics correlated with this dictionary and the strongest magnitudes of correlations. One common descriptor across majority Black, majority Hispanic, and Black white mix neighborhoods is the image of quiet homes/streets. Noise-level also comes up for majority Black neighborhoods in the form of language that provides rules for guests about curfews and policies (pm, guests, after hours) to maintain the peacefulness and quiet of the neighborhood. In Hispanic neighborhoods, the emphasis was on a family-friendly environment (family-oriented, schools, residential), whereas descriptors of majority Black neighborhoods emphasized diversity (culture, ethnicity, histories) and friendliness (dogs, neighborly, pleasant) of the residents. Safety was discussed across both Majority Black and Hispanic neighborhoods, but largely in the context of the physical design of the homes (cul-de-sacs, no traffic, private property, gated, peaceful, quiet hours, peacefulness, security). Although safety appeared in the descriptions of predominantly white neighborhoods, it came up in general terms with superlative language that described the neighborhood’s desirability (safest, most desirable, best areas) but did not feature significant discussion of physical infrastructures or means of offering greater safety. Lastly, “urban” was a common descriptor across Majority Black and Black-White Mixed neighborhoods. However, it is unique from the other topics because it contains negating language in relation to the homeless population (urban, diverse, but, note, homeless, people). Below are two listings that demonstrate how hosts frame their neighborhood as desirable despite the presence of a homeless population:\r\n\r\n“The area is ridiculously hip. Feel free to search”Arts District Los Angeles” and “Little Tokyo” to read up on the hood. Keep in mind that most parts of Los Angeles these days has (sic) a homeless problem. Downtown Los Angeles and its surrounding areas are not exempt. Luckily for us, we have a well lit building and a great security system.”\r\n\r\n\r\n“LA Times just called us (Jefferson Park) the hottest up and coming neighborhood [sic]…however, We’ve lived here before it was”up and coming” and still loved it! If you need a Whole Foods, BMWs, and fancy lawns, you might want to stay in Beverly Hills. If you like dollar ice cream trucks, street tamale vendors and neighbors who look out for each other - we’d love to have you! Like most expensive cities, we have homeless people, some blight, and you’re likely to hear several languages on my block (I’m Filipino-American and people on my block are of every persuasion). Most who come with open minds find it to be a friendly, diverse, working and middle-class community.”\r\n\r\nAltogether, the topics that were most strongly associated with humanizing details provide portraits of the social, natural, and built environments of the neighborhoods and how they relate to neighborhood racial composition. Whereas the leisure-related topics identified neighborhood-level racial differences in the points of interest and activity spaces that are marketed in listings.\r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-06-airbnb/fig1_airbnblocs_nhoodtypes.jpg",
    "last_modified": "2023-07-28T01:40:10-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-06-blindreviews/",
    "title": "Web Scraping & Analysis of Blind Reviews",
    "description": "Code and analysis from the web-scraper script and analysis workflow that I created for the Blind Review listening channel for the Intuit People Analytics Team.",
    "author": [],
    "date": "2022-04-01",
    "categories": [
      "Web Scraping",
      "Workflows",
      "Data Visualization"
    ],
    "contents": "\r\nWhen I interned at Intuit, my manager expressed interest in having a channel that included some competitive intelligence so that we could compare the employee experience at Intuit to the experience at competitors. She was interested in the reviews employees leave anonymously on Blind.\r\nBased on her vision, I crafted the code to scrape ratings on Intuit’s Blind page and the pages of five other competitors: Microsoft, Salesforce, Google, Facebook/Meta, and Amazon and analyze the reviews on a monthly basis. The images and slide deck below show the final outputs of the end-to-end process that I devised.\r\n\r\n\r\n\r\nFigure 1: Ratings Overview\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 2: Monthly Review Frequency\r\n\r\n\r\n\r\n#View the components of the end-to-end Blind Reviews Workflow:\r\n\r\nThe Deliverable: I mocked up the slides included on the Blind monthly analysis that we would present to the managers of the analytics and research team.    Slides \r\nScraping Functions: These functions are imported into the execution script and can be seen below.    Code \r\nExecutable Scraping Script:    Code \r\nAnalysis Script:    Code \r\nAll Code:    GitHub Repo \r\nScraping & Cleaning Functions\r\n\r\n\r\n## Scalar Review Scraping Functions Script ## \r\n\r\n## Overview & Getting Started\r\n\r\n#The script contains functions to perform the following steps:\r\n\r\n# * Find the maximum number of pages to be queried on Blind.\r\n# * Generate all the sub-pages that make up the reviews\r\n# * Scrape the information from each of them\r\n# * Combine the information into one comprehensive data frame\r\n\r\n# This script is sourced in the execute_blind_webscraper.Rmd file. \r\n# Parameter values for these functions are set in the first chunk of the execute file. \r\n\r\n################################################################################\r\n## Step 1\r\n# **Write Functions to Extract key Information from Each Field of the Review**\r\n#   \r\n# Rely on developer tools, i.e., inspect option when right clicking on feature on webpage, to find the html tag that contains the piece of the review you want to extract. \r\n# \r\n# The pieces of the review that we care about are AND can scrape: \r\n#   \r\n# - Review title\r\n# - Reviewer's job title\r\n# - Review ratings\r\n\r\n\r\n# Define functions that extract the key pieces of the review\r\n\r\n## Title\r\nget_review_title <- function(html){\r\n  html %>% \r\n    # Specify the relevant tag\r\n    html_nodes('.rvtit') %>%      \r\n    html_text() %>% \r\n    # Trim additional white space\r\n    str_trim() %>%                       \r\n    # Convert the list into a vector\r\n    unlist()                             \r\n}\r\n\r\n## Reviewer Demographics (current/former; job title)\r\nget_reviewer_info <- function(html){\r\n  html %>% \r\n    # Specify the relevant tag for the node\r\n    html_nodes('.auth') %>% \r\n    html_text() %>% \r\n    str_trim() %>% \r\n    str_remove(\"Verified User\") %>% \r\n    str_trim() %>%\r\n    unlist()\r\n}\r\n\r\n## Star-Ratings\r\nget_reviews <- function(html){\r\n  html %>% \r\n    # Specify the relevant tag for the node\r\n    html_nodes('.review_item_inr') %>%      \r\n    html_text() %>% \r\n    # Trim additional white space\r\n    str_trim() %>%  \r\n    # Convert the list into a vector\r\n    unlist()                             \r\n}\r\n\r\n################################################################################\r\n\r\n## Step 2\r\n\r\n#*Scrape Website*\r\n\r\nget_data_table <- function(html){\r\n  \r\n  # Extract the Basic information from the HTML\r\n  title <- get_review_title(html) \r\n  review_info <- get_reviewer_info(html)\r\n  reviews <- get_reviews(html)\r\n  \r\n  \r\n  # Combine into a tibble\r\n  combined_data <- tibble(\r\n    reviewer = review_info,\r\n    title = title,\r\n    review = reviews\r\n  ) \r\n}\r\n\r\n\r\nget_data_from_url <- function(url){\r\n  html <- read_html(url)\r\n  get_data_table(html)\r\n}\r\n\r\n\r\nscrape_write_table <- function(url){\r\n  \r\n  # Apply the extraction and bind the individual results back into one table, \r\n  # which is then written as a tsv file into the working directory\r\n  list_of_pages %>% \r\n    # Apply to all URLs\r\n    map(get_data_from_url) %>%  \r\n    # Combine the tibbles into one tibble\r\n    bind_rows()      \r\n}\r\n\r\nscraped_data <- scrape_write_table(url) \r\n\r\n\r\n################################################################################\r\n## Step 3 \r\n\r\n#*Create a clean data table & Export for Analysis**\r\nclean_scraped_data <- function(x) {\r\n  x %>%\r\n    mutate(\r\n      #Overall Rating\r\n      overall_rating = str_extract(review,\r\n                                   \"Rating Score[[:digit:]]\" ),\r\n      overall_rating = str_remove(overall_rating,\r\n                                  \"Rating Score\"), \r\n      #Career Growth\r\n      career_growth_rating = str_extract(review, \r\n                                         \"[[:digit:]]Career\"),\r\n      career_growth_rating = str_extract(career_growth_rating, \"[[:digit:]]\"),\r\n      #WLB \r\n      wlb_rating = str_extract(review,\r\n                               \"[[:digit:]]Work - Life Balance\"),\r\n      wlb_rating = str_extract(wlb_rating, \r\n                               \"[[:digit:]]\"),\r\n      #Compensation / Benefits\r\n      compensation_rating = str_extract(review, \r\n                                        \"[[:digit:]]Compensation / Benefits\"),\r\n      compensation_rating = str_extract(compensation_rating, \r\n                                        \"[[:digit:]]\"),\r\n      #Company Culture\r\n      company_culture_rating = str_extract(review,\r\n                                           \"[[:digit:]]Company\"),\r\n      company_culture_rating = str_extract(company_culture_rating, \r\n                                           \"[[:digit:]]\"),\r\n      #Management \r\n      management_rating = str_extract(review, \r\n                                      \"[[:digit:]]Management\"),\r\n      management_rating = str_extract(management_rating, \r\n                                      \"[[:digit:]]\"),\r\n      # Review Title\r\n      title = str_remove(title, \"“\"),\r\n      title = str_remove(title, \"”\"),\r\n      title = str_trim(title, side = \"both\"),\r\n      # Employment Status\r\n      emp_status = sub(\"\\\\·.*\", \"\", reviewer),\r\n      # Review Date\r\n      date = sub('.*-', '', reviewer),\r\n      date = str_trim(date, side = \"both\"),\r\n      # Reviewer Job Title\r\n      job_title = sub(\".*·\", \"\", reviewer),\r\n      job_title = sub('-.*', \"\", job_title),\r\n      job_title = str_trim(job_title, side = \"both\")\r\n    ) %>% \r\n    select(-review, -reviewer) %>% \r\n    relocate(date,\r\n             emp_status, \r\n             job_title, \r\n             overall_rating, \r\n             career_growth_rating, \r\n             wlb_rating, \r\n             compensation_rating, \r\n             company_culture_rating, \r\n             management_rating,\r\n             title)  %>% \r\n    mutate(across(ends_with(\"_rating\"), ~as.numeric(.x))) %>% \r\n    separate(date,\r\n             c(\"Month\", \"Day\", \"Year\"),\r\n             sep = \" \",\r\n             remove = FALSE) %>% \r\n    mutate(Month = match(Month, month.abb),\r\n           Day = as.numeric(str_remove(Day, \",\")),\r\n           Year = as.numeric(Year),\r\n           Date_obj = make_date(Year, Month, Day)\r\n    ) %>% \r\n    relocate(date, Date_obj) %>% \r\n    arrange(desc(Date_obj))\r\n  \r\n  \r\n}\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-06-blindreviews/blind_table.png",
    "last_modified": "2023-08-19T13:10:57-05:00",
    "input_file": {}
  },
  {
    "path": "project/2021-09-29-messagingtrends/",
    "title": "Messaging Trends",
    "description": "A graph of messaging trends in the Covid-19 Pandemic Work-From-Home era.",
    "author": [],
    "date": "2021-09-29",
    "categories": [
      "Data Visualization"
    ],
    "contents": "\r\nCommunication during Work-From-Home\r\nI extracted Intuit’s messaging data from Outlook email, Zoom web calls, and Slack messages and aggregated the records to the enterprise level per week to show trends in messaging overload.\r\nThe visual is a replica of a graphic I created during my tenure at Intuit; data have been altered from real data to replicate the graph without revealing Intuit’s data.\r\n\r\nI used R for the data extraction, cleaning, and visualization.\r\nThe visual showcases my design aesthetic - functional and minimalist.\r\n\r\n\r\n\r\nFigure 1: Messaging Trends in the Pandemic Work-From-Home Era. Note: Outlook email data was missing for last half of 2020 and first two months of 2021 due to database system transition.\r\n\r\n\r\n\r\nInsights\r\nZoom meeting minutes were generally at or above 200% baseline meeting minutes from August 2020 onward, suggesting that adoption of Zoom for meetings, check-ins, and social gatherings.\r\nSlack and email communication are far more stable than Zoom minutes during busier quarters (e.g., tax season).\r\nRecharge days achieve the desired effect of encouraging employees to take a break from the day-to-day activities in their work.\r\nVisualization Code:    Code \r\nNote: data extraction code was excuted in a different script.\r\n\r\n\r\n\r\n",
    "preview": "project/2021-09-29-messagingtrends/voe_messaging_line_replicate_annotate.jpg",
    "last_modified": "2023-08-19T15:16:35-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-06-storymap/",
    "title": "Excelsior Neighborhood Story Map",
    "description": "View my map story of the history and social life of San Francisco's Excelsior neighborhood.",
    "author": [],
    "date": "2021-05-20",
    "categories": [
      "GIS",
      "Data Visualization",
      "Neighborhoods"
    ],
    "contents": "\r\nWhat is a Story Map\r\nESRI Story Maps are web applications that let you, the author, combine web-maps with narrative text, images, and multimedia, including video and audio. The applications are designed to be attractive and usable by anyone, which makes them great for education and outreach to the general public or to a particular audience. Story maps can be made for many different topics. Basically, anything that you can show on a map can be the topic of a story map!\r\nStory Map of San Francisco’s Excelsior Neighborhood\r\nAs the TA for the undergraduate urban lab course called The Social Life of Neighborhoods in Stanford’s Sociology Department, I created a story map for the Excelsior neighborhood as an example for students in the class.\r\nYou can view the original story map here. Click on the expand option in the bottom right hand corner of the iframe below to view the story in full-screen mode.\r\n\r\n\r\nESRI has limited support for the original story map builder, so I transposed the original version into the new storymap build.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-06-storymap/Excelsior_Callout.png",
    "last_modified": "2023-06-07T10:36:50-05:00",
    "input_file": {}
  },
  {
    "path": "project/2023-06-06-webmappingtutorials/",
    "title": "Web Mapping & Analysis Tutorials",
    "description": "View the tutorials I created for web mapping and analysis in ArcGIS Online.",
    "author": [],
    "date": "2021-03-28",
    "categories": [
      "GIS",
      "Course Materials",
      "Neighborhoods"
    ],
    "contents": "\r\nThe Social Life of Neighborhoods was a course offered through Stanford’s Sociology Department in the spring of 2021. The underlying goal of the course is to mount a quarter long\r\nintellectual investigation of a neighborhood and the various processes that structure its “social life”— that is, the way it developed historically, reproduces itself on a daily basis, and is subjectively experienced by various individuals and groups. View the course syllabus to see a complete description of the course and all of the assignments.\r\nI constructed tutorials on a weekly basis to prepare students for upcoming mapping assignments. The tutorials were published in a Gitbook that you can preview below and visit here. The repository for the code is linked below the preview.\r\n\r\n\r\n   Code \r\n\r\n\r\n\r\n",
    "preview": "project/2023-06-06-webmappingtutorials/filter_day_of_week.gif",
    "last_modified": "2023-06-07T10:35:16-05:00",
    "input_file": {}
  },
  {
    "path": "project/2021-02-15-strava/",
    "title": "Minimalist Visualizations of Strava Activities",
    "description": "A digital garden of minimalist visualizations that I create from my Strava activities.",
    "author": [],
    "date": "2021-02-15",
    "categories": [
      "Data Visualization",
      "GIS",
      "Recreation"
    ],
    "contents": "\r\nWhen I have some downtime, I extract my Strava activities from the Strava API to practice minimalist visualizations and view trends in my exercise activities. I stock-pile the visuals here to have a single place where I can refer to what visuals I have previously made, so that I can formulate what to practice on in the future. The repo with my code can be found on GitHub, however, I have included some snippets here as well.\r\n\r\n   GitHub Repo \r\n\r\nRuns\r\nIdentifying my running neighborhood\r\nI filtered down to the top 20% of routes I traversed in the last two years, which is how long I have lived in San Mateo. The code reveals the substantial amount of data wrangling that went into transforming a non-spatial dataframe with Google Polylines into spatial routes (lines).\r\nThe maps show that my running neighborhood skirts along the boundaries of San Mateo and Burlingame. This is why I call my neighborhood “Bur Mateo.”\r\n\r\n\r\n# Wrangle activites to routes\r\ndecoded_polyline <- googlePolylines::decode(\r\n  activities_summary_polyline$map.summary_polyline)\r\n\r\nunlist_polyline <- map_df(decoded_polyline, ~as.data.frame(.x), .id=\"id\")\r\n\r\nfull_polyline_df <- unlist_polyline %>% \r\n  left_join(., activities_summary_polyline_id, by = c(\"id\" = \"id_p\"))\r\npoints_to_line <- function(data, long, lat, id_field = NULL, sort_field = NULL) {\r\n  \r\n  # Convert to SpatialPointsDataFrame\r\n  coordinates(data) <- c(long, lat)\r\n  \r\n  # If there is a sort field...\r\n  if (!is.null(sort_field)) {\r\n    if (!is.null(id_field)) {\r\n      data <- data[order(data[[id_field]], data[[sort_field]]), ]\r\n    } else {\r\n      data <- data[order(data[[sort_field]]), ]\r\n    }\r\n  }\r\n  \r\n  # If there is only one path...\r\n  if (is.null(id_field)) {\r\n    \r\n    lines <- SpatialLines(list(Lines(list(Line(data)), \"id\")))\r\n    \r\n    return(lines)\r\n    \r\n    # Now, if we have multiple lines...\r\n  } else if (!is.null(id_field)) {  \r\n    \r\n    # Split into a list by ID field\r\n    paths <- sp::split(data, data[[id_field]])\r\n    \r\n    sp_lines <- SpatialLines(list(Lines(list(Line(paths[[1]])), \"line1\")))\r\n    \r\n    # I like for loops, what can I say...\r\n    for (p in 2:length(paths)) {\r\n      id <- paste0(\"line\", as.character(p))\r\n      l <- SpatialLines(list(Lines(list(Line(paths[[p]])), id)))\r\n      sp_lines <- spRbind(sp_lines, l)\r\n    }\r\n    \r\n    return(sp_lines)\r\n  }\r\n}\r\n\r\nburmateo <- full_polyline_df %>%\r\n  filter(lon >=-122.37 & lon <= -122.0) %>%\r\n  filter(lat >= 37.55 & lat <= 37.65)\r\n\r\nv_lines <- points_to_line(data = burmateo,                            , \r\n                          long = \"lon\", \r\n                          lat = \"lat\", \r\n                          id_field = \"id\")\r\n\r\nv_lines_sf <- as(v_lines, \r\n                 \"sf\") \r\nst_crs(v_lines_sf) <- 4326\r\ndark_basemap <- cc_location(loc = raster::extent(v_lines_sf), \r\n  #zoom = 12,\r\n  get_tiles = \"https://api.mapbox.com/styles/v1/mapbox/dark-v10/tiles/{zoom}/{x}/{y}\",\r\n  access_token = token) \r\n\r\nlines_bbox <- st_as_sfc(st_bbox(v_lines_sf))\r\n\r\n# Draw Map\r\ntm_static_nhood <- \r\n  tm_static_mapbox(location = v_lines_sf %>% \r\n                     st_transform(7131), \r\n    style_url = \"mapbox://styles/francinestephens/cli17a3cl00v501pohaykfiqe\",\r\n    username = user) +\r\n  tm_shape(v_lines_sf  %>% \r\n             st_transform(7131)) + \r\n  tm_lines(alpha = 0.4, \r\n           col = \"steelblue\") + \r\n  tm_layout(frame = FALSE)\r\n\r\n\r\n\r\n\r\n\r\nFigure 1: Local Running Routes on a basemap\r\n\r\n\r\n\r\nI wanted to plot the runs against parcel data, which are one of my favorite spatial data types to work with to create a minimalist-look. To capture the subset of parcels in my running neighborhood, I created a bounding to clip the county’s parcels down to just the window that features my neighborhood.\r\n\r\n\r\n# PARCELS \r\nst_crs(parcels)\r\nparcels_reduced <- parcels %>% \r\n  st_transform(., crs = 4326) %>%\r\n  filter(city == \"SAN MATEO\"  | city == \"BURLINGAME\") %>% \r\n  st_intersection(., lines_bbox)\r\n\r\nparcel_version <- \r\n  tm_shape(smc) + \r\n  tm_fill(col = \"white\") + \r\n  tm_shape(parcels_reduced) + \r\n  tm_fill(\"MAP_COLORS\", palette=\"Greys\", alpha = .25) + \r\n  tm_shape(v_lines_sf) + \r\n  tm_lines(alpha = 0.4, \r\n           col = \"steelblue\") + \r\n  tm_layout(frame = FALSE, bg.color = \"white\"\r\n            )\r\n\r\n\r\n\r\n\r\n\r\nFigure 2: Minimalist view of runs plotted against parcels\r\n\r\n\r\n\r\nPandemic runs\r\nThe images below are limited to my runs at Stanford and in the Texas Hill Country, which were the two locations that I split time in during this period.\r\n\r\n\r\n# SET COLORS AND THEMES\r\nstanford_cardinal <- \"#8C1515\"\r\ndark_green <- \"#006400\"\r\n\r\ncolors_runs <- scale_color_manual(values = c(stanford_cardinal,\r\n                                             dark_green)\r\n) \r\n\r\ntheme_by_location <- theme_void(base_family = \"Rockwell\",\r\n                                base_size = 13) +\r\n  theme(panel.spacing = unit(0, \"lines\"),\r\n        strip.background = element_blank(),\r\n        strip.text = element_blank(),\r\n        plot.margin = unit(rep(1, 4), \"cm\"),\r\n        legend.position = \"none\",\r\n        plot.title = element_markdown(hjust = 0.5, vjust = 3)\r\n  )\r\n\r\nruns_by_location <- ggplot(all_runs) +\r\n  geom_path(aes(lng, lat, group = id, color = location), size = 0.35, lineend = \"round\") +\r\n  facet_wrap(~location, scales = 'free') +\r\n  labs(title = \"Francine's \r\n       <span style='color:#8C1515'>Stanford<\/span> & <span style='color:#006400'>Rockwall Ranch, NBTX<\/span> Runs\",\r\n       caption = \"Runs as of April 14, 2021\") +\r\n  theme_by_location +\r\n  colors_runs\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\ntheme_runs <- theme_void(base_family = \"Rockwell\",\r\n                         base_size = 20) +\r\n  theme(panel.spacing = unit(0, \"lines\"),\r\n        strip.background = element_blank(),\r\n        strip.text = element_blank(),\r\n        plot.margin = unit(rep(1, 4), \"cm\"),\r\n        legend.position = \"none\",\r\n        plot.title = element_text(hjust = 0.5, vjust = 3)\r\n  )\r\n\r\nruns_moonrise <-  ggplot(all_runs) +\r\n  geom_path(aes(lng, lat, group = id, color = group_col), size = 0.35, lineend = \"round\") +\r\n  facet_wrap(~id, scales = 'free') + \r\n  labs(title = \"Francine's Runs\") + \r\n  theme_runs + \r\n  scale_color_manual(values=wes_palette(n=5, name=\"Moonrise3\"))\r\n\r\n\r\n\r\n\r\n\r\nAll Activities\r\nThe following graphs that document the distance and minutes exercised over the last four years show how much working on my dissertation has reduced my ability to run/bike/hike/walk as far or as frequently as before I got into the weeds of the dissertation. Hopefully, the 2023 trends will start to increase at a high clip and become closer to the exercise levels of early 2022 and 2021.\r\nDistance\r\n\r\n\r\nactivities_data_c <- activities_data %>%\r\n  mutate(start_date = as_date(start_date),\r\n         year = year(start_date),\r\n         day_of_year = yday(start_date),\r\n         month = month(start_date),\r\n         day = wday(start_date, label = TRUE),\r\n         week = week(start_date))\r\n\r\nactivities_data_c %>%\r\n  group_by(year) %>%\r\n  arrange(start_date) %>%\r\n  mutate(cumulative_distance = cumsum(distance)) %>%\r\n  ungroup() %>% \r\n  filter(year > 2019) %>%\r\n  ggplot(aes(x = day_of_year, y = cumulative_distance, color = factor(year))) +\r\n  geom_line() +\r\n  scale_y_continuous(labels = scales::comma) + \r\n  scale_color_brewer(palette = \"Set1\") +\r\n  labs(title = \"Cumulative distance per year\",\r\n       subtitle = \"Last 4 years of runs, bikes, hikes, and walks\",\r\n       x = \"Day of Year\",\r\n       y = \"Cumulative Distance (Miles)\",\r\n       color = \"Year\",\r\n       caption = \"Francine's Strava Data\") + \r\n  theme_classic()\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n# CALENDAR HEAT MAP OF DISTANCE COVERED EACH DAY\r\nggplot(activities_data_c %>% \r\n         filter(year > 2018), aes(x = week, y = factor(day))) +\r\n  geom_tile(aes(fill = distance)) +\r\n  scale_fill_continuous(low = \"lightgreen\",\r\n                        high = \"red\") +\r\n  facet_wrap(~ year,\r\n             scales = \"free_x\") +\r\n  labs(x = \"Week\",\r\n       y = \"\",\r\n       title = \"Calendar Heat Map of Distance in Miles\",\r\n       caption = \"Francine's Strava Data\") + \r\n  theme_classic()\r\n\r\n\r\n\r\n\r\n\r\nTime\r\n\r\n\r\nggplot(activities_data_c %>% \r\n         filter(year > 2018) %>% \r\n         group_by(year, week, day) %>% \r\n         summarize(time = sum(elapsed_time, na.rm = TRUE)) %>% \r\n         ungroup() %>% \r\n         mutate(minutes = time/60), \r\n       aes(x = week, y = factor(day))) +\r\n  geom_tile(aes(fill = minutes)) +\r\n  scale_fill_continuous(low = \"lightgreen\",\r\n                        high = \"red\") +\r\n  facet_wrap(~ year,\r\n             scales = \"free_x\") +\r\n  labs(x = \"Week\",\r\n       y = \"\",\r\n       title = \"Calendar Heat Map of Exercise Time in Minutes\",\r\n       caption = \"Francine's Strava Data\") + \r\n  theme_classic()\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "project/2021-02-15-strava/runs_041421_by_location.png",
    "last_modified": "2023-06-07T13:53:16-05:00",
    "input_file": {}
  },
  {
    "path": "project/2021-02-09-seattlecrimeanalysismaps/",
    "title": "Crime Analysis and Mapping in Seattle",
    "description": "Examples of exploratory data analysis in web-reports with interactive graphs, tables, and maps.",
    "author": [],
    "date": "2021-02-09",
    "categories": [
      "GIS",
      "Data Visualization",
      "Neighborhoods"
    ],
    "contents": "\r\nBelow are examples of thorough explanatory data analysis that presented as a series of web reports for a professor at Stanford University. The work showcases my ability to use R Markdown, Plotly, and Leaflet for interactive graphs, tables, and maps.\r\nView Github Repo:    Code \r\nSeattle 911 Calls EDA\r\n\r\n\r\n\r\nFigure 1: Interactive Time Series Graph from Exploratory Analysis\r\n\r\n\r\n\r\nView Full Website:    Web-Report \r\nSeattle 911 Calls for Disturbance, Suspicious Persons, and Trespass Complaints\r\n\r\n\r\n\r\nFigure 2: Interactive Hot Spot Map of Suspicious Person Calls\r\n\r\n\r\n\r\nView Full Website:    Web-Report \r\nSeattle 911 Calls: No Police Action Taken (NPAPN)\r\n\r\n\r\n\r\nFigure 3: Dot Plot of Case Types Resolved with No Police Action Taken\r\n\r\n\r\n\r\nView Full Website:    Web-Report \r\n\r\n\r\n\r\n",
    "preview": "project/2021-02-09-seattlecrimeanalysismaps/distill-preview.png",
    "last_modified": "2023-08-19T13:11:38-05:00",
    "input_file": {}
  }
]
